diapos/SRH_Assignment.tex
% Created 2019-02-21 jue 14:37
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{color}
\usepackage{listings}
\usepackage{mathpazo}
\author{Oscar Perpi침치n Lamigueiro}
\date{}
\title{Session \#1 Assignment\\\medskip
\large Fundamentals of Photovoltaic Engineering}
\hypersetup{
 pdfauthor={Oscar Perpi침치n Lamigueiro},
 pdftitle={Session \#1 Assignment},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{enumerate}
\item Retrieve \textbf{daily} measurements from three nearby meteorological stations (time series length 10 years).
\item \emph{(Session \#2) Filter each time series using physical limits}.
\item Compute a \textbf{daily} time series representative of the region with the average of the three time series.
\item Compare this average time series with each station using statistical metrics (MBD, RMSD, MAD).
\item Choose a location inside the perimeter defined by the three stations, and estimate the \textbf{monthly averages} of daily solar radiation using spatial interpolation (IDW).

\noindent\rule{\textwidth}{0.5pt}
\item \emph{Retrieve \textbf{monthly averages} of solar radiation from a satellite service (preferably CMSAF, with QGis or similar software) for a region covering the three stations.\footnote{CMSAF solar radiation data (SIS) are published as daily average \textbf{irradiance} (\(W/m^2\)). Therefore, you have to multiply them by 24 to get daily irradiation values.}}
\item \emph{Compare the satellite values at the three locations with the monthly averages of the measurements provided by the stations, using statistical metrics.}
\item \emph{Combine the satellite estimations at the location defined in step \#5 with the \textbf{monthly averages} of the result of that step. Thus, if we denote the monthly averages of daily values of step \#5 with \(G_{dm,IDW}\) and the satellite estimates with \(G_{dm,sat}\), the result of this step is (for each month)}:
\end{enumerate}
\[G_{dm} = 1/2 \cdot (G_{dm,IDW} + G_{dm,sat})\]

\textbf{The result of step \#8 (or \#5) will be used in Session \#2}.
\end{document}